{"meta":{"title":"Tom's Blog","subtitle":null,"description":null,"author":"Tom Le","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"Vocabulry Ajective","slug":"adjective-vocabulary","date":"2016-11-23T11:02:18.000Z","updated":"2016-11-23T11:27:53.000Z","comments":true,"path":"2016/11/23/adjective-vocabulary/","link":"","permalink":"http://yoursite.com/2016/11/23/adjective-vocabulary/","excerpt":"","text":"Ambitions Fabulous Anxious Humble Pathetic","categories":[],"tags":[],"keywords":[]},{"title":"Bike over hill experience when fog and rain running on my trip at night","slug":"my-birthday","date":"2016-11-21T14:02:49.000Z","updated":"2016-11-21T15:12:45.000Z","comments":true,"path":"2016/11/21/my-birthday/","link":"","permalink":"http://yoursite.com/2016/11/21/my-birthday/","excerpt":"","text":"My story: Why I make this blog? I want to keep my emotion, feeling my trip in Blog. And it’s memorable, and 20 November, 2015. My Unbelievable birthday ever. Yesterday, I decided traveling to Lao Bao from Hue city. There’re 2 way from Hue City to Lao Bao: One is QL1A street and the rest is HCM street. So I make the rule “Don’t go the same way”. That mean morning i came at QL1A street and came back at HCM street. The story is not easy in this way. I started at 9:00 am from Hue city with a niece (3 years old), a sister-in-law, a friend. We have 4 people traveling to Lao Bao. Like I said, I bike at QL1A first, It’s so easy to handling. The street is a good and wide. The sky is so clear, and sunny day. I finished Lao Bao city at 1pm. I have luch at 12pm. It far from Lao Bao 11 km. So we decided go market until 2:30 pm. And we come back home. But I decided go another way. HCM Street, I want to discover the scenery and people live here. But I don’t care it’s bad choose when I selected.","categories":[],"tags":[],"keywords":[]},{"title":"How can I write a good CV","slug":"writing-cv","date":"2016-11-18T01:24:46.000Z","updated":"2016-11-18T01:41:31.000Z","comments":true,"path":"2016/11/18/writing-cv/","link":"","permalink":"http://yoursite.com/2016/11/18/writing-cv/","excerpt":"","text":"My story:I took part in Apollo class on October,2016 . I learning some useful about write a good CV. Learning from:Apollo class. SummaryHave a job? Knocking the door Choose what you love and the job will find you Prepare some question about interview Write a special CV not a good CV Send by email. (Study how you can write a good email &gt; Tomorrow) Reply email when employee send mail, even you’re fail. (Say thank you!)Have a special CV? Make who you are by your avatar Focus what you are strengths ( write bold and bigger size ), Write the website/blog you find out everyday Let them know what book you love, film you like With IT, you should write down your linkedin,Github, Your Blog… I will write detail later. Bye all guys Enjoy!Have a nice day!","categories":[],"tags":[],"keywords":[]},{"title":"How can I boost my memory?","slug":"boost_memory","date":"2016-11-17T00:40:58.000Z","updated":"2016-11-17T00:58:02.000Z","comments":true,"path":"2016/11/17/boost_memory/","link":"","permalink":"http://yoursite.com/2016/11/17/boost_memory/","excerpt":"","text":"My story: I have a bad memory, because when someone introduce themself. It’s hard to me for remember their name. So for be sure, I always use “You and me” in conversation. And i realized when i’s learnt something. It not stay in my head in 1 day. So I wonder why my brain or my memory so bad. So I find out in some website. How can I boot my memory. I realized that I do wrong everyday and it’s the main reason to destroy my memory. First I go to bed too late and not routine. When i wake up, always consider have a luch or have a breakfast. My diet not good. And many reason let my brain go down. So I have to create this topic to promise myseft, Don’t go the old way. Learning from: http://www.helpguide.org/articles/memory/how-to-improve-your-memory.htm Summary on that page: Have a brain workout. Don’t miss any physical exercise. Get the Zs enough. Have consider your diet everyday. Leaning a new things (poem/guitar/France)… Laugh everyday.Enjoy!Have a nice day!","categories":[],"tags":[],"keywords":[]}]}