{"meta":{"title":"Tom's Blog","subtitle":null,"description":null,"author":"Tom Le","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"Hiểu rõ nguyên nhân và phòng chống các thủ thuật tấn công wireless","slug":"rogue-AP","date":"2017-01-03T09:55:47.000Z","updated":"2017-01-03T10:45:21.000Z","comments":true,"path":"2017/01/03/rogue-AP/","link":"","permalink":"http://yoursite.com/2017/01/03/rogue-AP/","excerpt":"","text":"Nguyên nhân lập topic-&gt; Nhầm chia sẽ những thứ mình hiểu và nằm rõ trong quá trình vọc vạch.-&gt; Lưu trữ lại các quá trình, sau này có thể đọc lại. Các câu hỏi đặt raNếu bạn đã trả lời hết những câu hỏi dưới đây. Bạn cũng không cần phải đọc topic mình đâu. Rogue AP là gì? Vì sao phải cần nó? Cơ chế ngắt mạng victim ra sao? Vì sao người ngoài ( người không cần kết nối wifi nhà bạn ) có thể phá network nhà bạn? Một ngày đẹp trời bạn thấy một cái AP( wifi thường gọi, nhưng không phải nhé ) giống mình, Vì sao thế? Pass facebook/gmail/…. bị mất? Nguyên nhân? Khắc phục những lỗi trên ra sao? Bạn có chắc đang dùng 1 network an toàn?Các khái niệm cơ bản trước khi trả lời câu hỏiCác khái niệm mình được rút gọn, và được định nghĩa theo phong cách mình. Nếu các bạn chưa hiểu rõ có thể bình luận phía dưới nhà. 1. AP là gì? Station là gì? a. AP (Access Point) Như hình bạn có thể thấy có 5 AP Thomson….,Uhomsom…., …. AP như là cái card wireless có hổ trợ phát wireless. Điện thoại có hổ trợ phát Wifi =&gt; Nó là AP Laptop phát Wifi =&gt; Nó là AP Usb Wireless =&gt; Nó là AP b. Station: Máy trạm Chúng ta đã hiểu AP là máy phát. Vậy AP cần các máy thu để trao đổi dữ liệu. Máy thu có thể hiểu là station. Vậy Station là các kết nối tới AP. Tóm lại: AP phát, Station thu. 2. Bạn có tự hỏi khi chúng ta bật wifi từ thiết bị, Chúng ta thấy tất cả các Wi-Fi xung quanh? Và có những WiFi nội bộ bạn không thấy được, tại sao vậy? Trả lời câu hỏi này bạn phải biết Beacon Frame là gì? AP phát ra dựa vào sóng RF( Radio Frequency) hay bạn thường gọi là sóng radio đấy. Vậy AP phát cái gì? Nó phát các frame(gồm package). Từ đây bạn có thể đoán được, tại sao device nhận được WiFi xung quanh?. AP nó phát frame giúp người khác biết nó là ai, và độ mạnh của AP Frame đó là gì? Beacon Frame Vậy Beacon Frame là frame được phát ra từ AP giúp device(điện thoại, laptop ….) thấy được. Beacon Frame có gì? Gồm có thông tin AP như tôi đã nói? Vậy thông tin chính xác nó là gì? Thật thú vị nếu bạn tự tìm hiểu nó bằng tool Wireshark(google để download nó nhé). Phần mềm này có thể bắt tất cả các gói tin xung quanh bạn. Đòi hỏi quyền root vì nó dùng raw-socket. Mình sẽ gửi vài hình ảnh dưới đây nếu các bạn nhác (Khuyến cáo không nên :D) Ở đây các bạn chú ý: Signal Strength( thể hiện độ mạnh yếu Wireless). Nghiên cứu tại đây Destination : ở dạng MAC ff:ff:ff:ff:ff:ff =&gt; AP muốn tất cả các device đều nhận. Source Address == BSSID : 18:44:e6:e1:b2:c4 (Gồm 24 bit đầu Nhà sản xuất, 24 bit cuối là Serial của từng card mạng )Ngoài ra còn có SSID: Gồm tên của Wireless mà AP tạo ra cho các trạm biết được.(Nằm ở mục Wireless Lan Management) 3. Bạn đã nắm được Beacon frame. Bạn đã từng thắc mắc , bạn scan wifi và chợt ra wifi cũ(wifi bạn đã kết nối ở nơi khác) lại xuất hiện ở nơi mới? Trường hợp này có thể xuất hiện ở một số device, một số device thì không. Câu trả lời đây là Probe Frame. Mà chính xác ở đây là Probe Frame Request. Probe Frame Request được tạo ra từ máy trạm nhằm mong muốn kết nối tới AP cũ. Tùy thuộc vào thuật toán nhận Wireless trên từng thiết bị có thể nó sẽ bắt lấy Probe Request. Và dĩ nhiên nó đã vô tình lấy Wifi cũ nhà bạn và lưu trong list Wifi hiện sẵn. 4. Bạn đã hiểu cơ chế nhận Wireless rồi. Vậy bạn đã hiểu cơ chế xác thực(authentication) và kết họp (association) từ máy trạm đến AP chưa?Continue….","categories":[],"tags":[{"name":"CIH","slug":"CIH","permalink":"http://yoursite.com/tags/CIH/"}],"keywords":[]},{"title":"Learning F8 App ReactNative by UML","slug":"learning-f8-app-rn","date":"2016-12-23T13:27:27.000Z","updated":"2016-12-23T17:21:38.000Z","comments":true,"path":"2016/12/23/learning-f8-app-rn/","link":"","permalink":"http://yoursite.com/2016/12/23/learning-f8-app-rn/","excerpt":"","text":"Just for learning F8app(by facebook) Describe F8 app is created by Facebook. It’s a basic example for React-Native (use redux). You can check here: https://github.com/fbsamples/f8app/tree/master/js. This post required some knowledge about redux,react. This is a life circle in React. This is so important in React. Each component in ReactNative will run above image. When state of a component change, the component will render again. Structure Directory├── setup.js├── F8App.js├── F8Navigator.js├── FacebookSDK.js├── PushNotificationsController.js├── actions├── common│ ├── BackButtonIcon.js│ ├── Carousel.js│ ├── F8Button.js│ ├── F8Colors.js│ ├── F8DrawerLayout.js│ ├── F8Header.js│ ├── F8PageControl.js│ ├── F8SegmentedControl.js│ ├── F8StyleSheet.js│ └── img│ ├── back.android.png├── filter│ ├── FilterScreen.js│ ├── FriendsList.js│ ├── Header.js├── flow-lib.js├── login├── rating├── reducers│ ├── config.js│ ├── createParseReducer.js│ ├── filter.js│ ├── friendsSchedules.js│ ├── index.js│ ├── maps.js│ └── user.js├── setup.js├── store│ ├── analytics.js│ ├── array.js│ ├── configureStore.js│ ├── promise.js│ └── track.js└── tabs ├── F8TabsView.android.js ├── F8TabsView.ios.js ├── MenuItem.js ├── info ├── maps ├── notifications └── schedule Detail First, F8App will call setup.js(./js/setup.js) 1. Setup.js Call configureStore from store directory(./store/configureStore) to apply redux 12&lt;Provider store=&#123;this.state.store&#125;&gt;store: configureStore(() =&gt; this.setState(&#123;isLoading: false&#125;)), While it waiting loading redux,it show the white screen 123 if (this.state.isLoading) &#123; return null;&#125; If loading finished, it will call F8App(./js/F8App) 123&lt;Provider store=&#123;this.state.store&#125;&gt; &lt;F8App /&gt;&lt;/Provider&gt; 2. F8App.jscomponentDidMount Adding event checking App status (foreground in App ,background in another App or home Screen) 1AppState.addEventListener(&apos;change&apos;, this.handleAppStateChange); Load notification,map … (download from the internet). You can check code in redux 1234567// TODO: Make this list smaller, we basically download the whole internetthis.props.dispatch(loadNotifications());this.props.dispatch(loadMaps());this.props.dispatch(loadConfig());this.props.dispatch(loadSessions());this.props.dispatch(loadFriendsSchedules());this.props.dispatch(loadSurveys()); Sync/Update code from server to user(Update code without download from AppStore/CH Play) 1CodePush.sync(&#123;installMode: CodePush.InstallMode.ON_NEXT_RESUME&#125;); render Check isLogined (use redux-persist in redux for save the data in local)If it’s not Login =&gt; Push Login Screenelse =&gt; push Navigator 1234567891011121314if (!this.props.isLoggedIn) &#123; return &lt;LoginScreen /&gt;; &#125; return ( &lt;View style=&#123;styles.container&#125;&gt; &lt;StatusBar translucent=&#123;true&#125; backgroundColor=&quot;rgba(0, 0, 0, 0.2)&quot; barStyle=&quot;light-content&quot; /&gt; &lt;F8Navigator /&gt; &lt;PushNotificationsController /&gt; &lt;/View&gt; ); Note: StatusBar =&gt; Work for Android.PushNotificationsController =&gt; Check and Push Notification is used react-native-push-notification library 3. F8Navigator.jscomponentDidMount Listening Press Back Button on Android. Use BackAndroid 123componentDidMount: function() &#123; BackAndroid.addEventListener(&apos;hardwareBackPress&apos;, this.handleBackButton);&#125;, use Navigator to change screen. 1234567891011121314151617&lt;Navigator ref=&quot;navigator&quot; style=&#123;styles.container&#125; configureScene=&#123;(route) =&gt; &#123; if (Platform.OS === &apos;android&apos;) &#123; return Navigator.SceneConfigs.FloatFromBottomAndroid; &#125; // TODO: Proper scene support if (route.shareSettings || route.friend) &#123; return Navigator.SceneConfigs.FloatFromRight; &#125; else &#123; return Navigator.SceneConfigs.FloatFromBottom; &#125; &#125;&#125; initialRoute=&#123;&#123;&#125;&#125; renderScene=&#123;this.renderScene&#125; /&gt; renderScene is like a router that switch scene.Default F8TabsView.js Remove event Listen Back Button 123componentWillUnmount: function() &#123; BackAndroid.removeEventListener(&apos;hardwareBackPress&apos;, this.handleBackButton);&#125;, NoteContext in React is like Global Variable. So you have consider when use it.It will take more memory and may be reduce performance. 123456getChildContext() &#123; return &#123; addBackButtonListener: this.addBackButtonListener, removeBackButtonListener: this.removeBackButtonListener, &#125;; &#125;, 4. F8TabView.js (./js/tab/F8TabsView.android.js and F8TabView.ios.js)Change Tab of DrawerLayout in Android or Tab of TabBar in IOS.Explain why have F8TabsView.android.js and F8TabView.ios.js. 1. When you run app on IOS RN(React Native) know call F8TabView.ios.js automatic. also when you run Android, it will call F8TabView.android.js 2. F8TabView.android use Drawer Layout (`DrawerLayoutAndroid` package) in Android, F8TabView.ios use TabBar(`TabBarIOS` package) in IOS. So we should separate file for compatible with User Experience(UX). F8TabView control tab by redux. So It can save the current tab even when you exit F8 App. (So interesting ,isn’t it? :D)Depend on tab selected, will call which Component(F8 NotificationsView, GerneralScheduleView, MyScheduleView, F8MapView) ……Continue……","categories":[],"tags":[{"name":"react native","slug":"react-native","permalink":"http://yoursite.com/tags/react-native/"}],"keywords":[]},{"title":"Relationship Class Diagram","slug":"relation-diagram","date":"2016-12-22T14:05:13.000Z","updated":"2016-12-22T14:09:21.000Z","comments":true,"path":"2016/12/22/relation-diagram/","link":"","permalink":"http://yoursite.com/2016/12/22/relation-diagram/","excerpt":"","text":"Ví dụ mang tính hài hước theo cách hiểu của mình.Mọi người có gì phản hồi nếu sai :D #1. Association —— / —–&gt;Có quan hệ mức thấp nhất.Class A sở hửu class B hoặc class B sử dụng class A #2. Aggregation ——&lt;&gt;Cũng như thằng Association nhưng mạnh hơn.Bởi vì nó cùng sinh ra hoặc cùng chết đi.Ví dụ:Ngón tay sinh ra thì bàn tay sinh ra :))Nhưng không có nghĩa ngón tay đứt thì bàn tay sẽ đứt.Đó chính là mối quan hệ AggregationVí dụ 2:Xe ô tô sinh ra thì động cơ, lốp xe sinh raNhưng không có nghĩa lốp xe mất đi thì ô tô mất đi :D #3. CompositionCũng như Aggregation nhưng quan hệ mạnh hơn (bắt buộc)Ví dụ 1:Tòa nhà sinh ra thì các phòng sinh raCũng như tòa nhà mất thì phòng sẽ mất và ngược lại Tưởng tượng rằng bạn ở mối quan hệ là “Bạn bè” thì ở mức Association (Có thể bạn là bạn của nó hoặc không)Nếu bạn có người yêu thì đang ở quan hệ Aggregation (Có thể yêu từ cùng một thời điểm, nhưng chán thì khác thời điểm :)) )Ở mức cao hơn là Composition ( Lỡ dại khi yêu ! :)) )","categories":[],"tags":[{"name":"CIH","slug":"CIH","permalink":"http://yoursite.com/tags/CIH/"}],"keywords":[]},{"title":"The Open Systems Interconnection Layer","slug":"osi-model","date":"2016-12-15T05:55:36.000Z","updated":"2016-12-30T17:33:36.000Z","comments":true,"path":"2016/12/15/osi-model/","link":"","permalink":"http://yoursite.com/2016/12/15/osi-model/","excerpt":"","text":"What is OSI? Why is OSI important? What OSI used for? What is the detail example for OSI? How many group of the OSI? and What function for any group? Answers OSI stand for Open Systems Interconnection. a networking framework. transform data. interact each layer. 2.3.4. 2 : Upper group(3 layer: Application, Presentation, Session)and Lower group(Transport, Network, DataLink, Physical)Upper Group: distribute data, encryption, decryption, compression, decompression, interface.Lower Group: data stream from a transmitting host to a destination host’s applicationApplication LayerinterfacePresentationencryption,decryption,compression,decompressionSessiondistribute data (what data is compatible what application)TransportConnection-Oriented Communication &gt;&gt; TCPFlow ControlWindows","categories":[],"tags":[{"name":"CIH","slug":"CIH","permalink":"http://yoursite.com/tags/CIH/"}],"keywords":[]},{"title":"Hackintosh with Dell 7447","slug":"hackintosh","date":"2016-11-26T17:00:17.000Z","updated":"2016-12-15T06:20:23.000Z","comments":true,"path":"2016/11/27/hackintosh/","link":"","permalink":"http://yoursite.com/2016/11/27/hackintosh/","excerpt":"","text":"InstroduceThis is all of file for Dell 7447 - core i7 Haswell 4510HQ- HD4600 - NVIDIA GTX 850MRun for all firmware OSX &lt; 10.12.1 Hardware Graphics HD 4600 : worked NVIDIA : not work Ethenet : worked Audio 255: worked (AppleHDA) Sleep: worked Camera: worked Battery: worked Sdcard: not work Wifi : Not work Brightness: Worded(Worded with Fn) Installing Copy EFI forder for clover Use Kext for enable all kext for dell 7447 Install wifi if you use usb wifi ContributeI’m so appriciate with your respect : tomle.zaku@gmail.comThe Git folder’s private already. If you interested in building this Dell 7447. Plz send my email : tomle.zaku@gmail.com","categories":[],"tags":[{"name":"hackintosh","slug":"hackintosh","permalink":"http://yoursite.com/tags/hackintosh/"}],"keywords":[]},{"title":"Vocabulry Ajective","slug":"adjective-vocabulary","date":"2016-11-23T11:02:18.000Z","updated":"2016-12-15T06:16:02.000Z","comments":true,"path":"2016/11/23/adjective-vocabulary/","link":"","permalink":"http://yoursite.com/2016/11/23/adjective-vocabulary/","excerpt":"","text":"Jealous Superficial Ambitions Fabulous Anxious Humble Pathetic Gorgeous Feeble","categories":[],"tags":[{"name":"english","slug":"english","permalink":"http://yoursite.com/tags/english/"}],"keywords":[]},{"title":"Bike over hill experience when fog and rain running on my trip at night","slug":"my-birthday","date":"2016-11-21T14:02:49.000Z","updated":"2016-12-15T06:15:53.000Z","comments":true,"path":"2016/11/21/my-birthday/","link":"","permalink":"http://yoursite.com/2016/11/21/my-birthday/","excerpt":"","text":"My story: Why I make this blog? I want to keep my emotion, feeling my trip in Blog. And it’s memorable, dangerous ever. 20 November, 2015. My Unbelievable birthday ever. Yesterday, I decided traveling to Lao Bao from Hue city. There’re 2 way from Hue City to Lao Bao: One is QL1A street and the rest is HCM street. So I make the rule “Don’t go the same way”. That mean morning i came at QL1A street and came back at HCM street. The story is not easy in this way. I started at 9:00 am from Hue city with a niece (3 years old), a sister-in-law, a friend. We had 4 people traveling to Lao Bao. Like I said, I biked at QL1A first, It’s so easy to handling. The street was a good and wide. The sky was so clear, and sunny day. I finished Lao Bao city at 1pm. I had lunch at 12pm. It far from Lao Bao 11 km. So we decided go market until 2:30 pm. And we came back home. But I decided go another way. HCM Street, I want to discover the scenery and people live here. But I don’t care it was bad choose when I selected. The story began at that time. We just come home with free soul, comfortable and funny talk. Take a picker, recording video of scenery. So fantastic, The scenery have more that I expect: stream, mountain, bird, people live here. They’s mixing together generate peace of place. I was deep in this solution until I realized the sky was covering dark.","categories":[],"tags":[{"name":"story","slug":"story","permalink":"http://yoursite.com/tags/story/"}],"keywords":[]},{"title":"How can I write a good CV","slug":"writing-cv","date":"2016-11-18T01:24:46.000Z","updated":"2016-12-15T06:16:08.000Z","comments":true,"path":"2016/11/18/writing-cv/","link":"","permalink":"http://yoursite.com/2016/11/18/writing-cv/","excerpt":"","text":"My story:I took part in Apollo class on October,2016 . I learning some useful about write a good CV. Learning from:Apollo class. SummaryHave a job? Knock at the door Choose what you love and the job will find you Prepare some question about interview Write a special CV not a good CV Send by email. (Study how you can write a good email &gt; Tomorrow) Reply email when employee send mail, even you’re fail. (Say thank you!)Have a special CV? Make who you are by your avatar Focus what you are strengths ( write bold and bigger size ), Write the website/blog you find out everyday Let them know what book you love, film you like With IT, you should write down your linkedin,Github, Your Blog… I will write detail later. Bye all guys Enjoy!Have a nice day!","categories":[],"tags":[{"name":"story","slug":"story","permalink":"http://yoursite.com/tags/story/"}],"keywords":[]},{"title":"How can I boost my memory?","slug":"boost_memory","date":"2016-11-17T00:40:58.000Z","updated":"2016-12-15T06:16:31.000Z","comments":true,"path":"2016/11/17/boost_memory/","link":"","permalink":"http://yoursite.com/2016/11/17/boost_memory/","excerpt":"","text":"My story: I have a bad memory, because when someone introduce themself. It’s hard to me for remember their name. So for be sure, I always use “You and me” in conversation. And i realized when i’s learnt something. It not stay in my head in 1 day. So I wonder why my brain or my memory so bad. So I find out in some website. How can I boot my memory. I realized that I do wrong everyday and it’s the main reason to destroy my memory. First I go to bed too late and not routine. When i wake up, always consider have a lunch or have a breakfast. My diet not good. And many reason let my brain go down. So I have to create this topic to promise myseft, Don’t go the old way. Learning from: http://www.helpguide.org/articles/memory/how-to-improve-your-memory.htm Summary on that page: Have a brain workout. Don’t miss any physical exercise. Get the Zs enough. Have consider your diet everyday. Leaning a new things (poem/guitar/France)… Laugh everyday.Enjoy!Have a nice day!","categories":[],"tags":[{"name":"story","slug":"story","permalink":"http://yoursite.com/tags/story/"}],"keywords":[]}]}